In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("titanic.csv")
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [4]:
df.drop(['PassengerId','SibSp','Parch','Ticket','Cabin','Embarked'], axis='columns', inplace=True)

In [5]:
df.head(4)

,Survived,Pclass,Name,Sex,Age,Fare
0,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833
2,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000

In [6]:
target = df.Survived
target.head(2)

0    0
1    1
Name: Survived, dtype: int64

In [7]:
inputs = df.drop('Survived', axis="columns")
inputs.head()

,Pclass,Name,Sex,Age,Fare
0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500
1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833
2,3,"Heikkinen, Miss. Laina",female,26.0,7.9250
3,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000
4,3,"Allen, Mr. William Henry",male,35.0,8.0500

In [38]:
inputs.groupby("Sex").describe()

    Pclass                                                Age             ...  \
     count      mean      std  min  25%  50%  75%  max  count       mean  ...
Sex                                                                       ...
0    314.0  2.159236  0.85729  1.0  1.0  2.0  3.0  3.0  314.0  28.216730  ...
1    577.0  2.389948  0.81358  1.0  2.0  3.0  3.0  3.0  577.0  30.505824  ...

                  Fare                                                      \
      75%   max  count       mean        std   min        25%   50%    75%
Sex
0    35.0  63.0  314.0  44.479818  57.997698  6.75  12.071875  23.0  55.00
1    35.0  80.0  577.0  25.523893  43.138263  0.00   7.895800  10.5  26.55


          max
Sex
0    512.3292
1    512.3292

[2 rows x 24 columns]

In [8]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
inputs["Sex"] = le.fit_transform(inputs.Sex)

In [9]:
inputs.head()

,Pclass,Name,Sex,Age,Fare
0,3,"Braund, Mr. Owen Harris",1,22.0,7.2500
1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,71.2833
2,3,"Heikkinen, Miss. Laina",0,26.0,7.9250
3,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,53.1000
4,3,"Allen, Mr. William Henry",1,35.0,8.0500

In [10]:
inputs = inputs.drop('Name',axis="columns")

In [12]:
inputs

     Pclass  Sex   Age     Fare
0         3    1  22.0   7.2500
1         1    0  38.0  71.2833
2         3    0  26.0   7.9250
3         1    0  35.0  53.1000
4         3    1  35.0   8.0500
..      ...  ...   ...      ...
886       2    1  27.0  13.0000
887       1    0  19.0  30.0000
888       3    0   NaN  23.4500
889       1    1  26.0  30.0000
890       3    1  32.0   7.7500

[891 rows x 4 columns]

In [16]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [23]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())

In [26]:
inputs.columns[inputs.isna().any()]

Index([], dtype='object')

In [28]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target, test_size=0.2)

In [29]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [31]:
model.fit(X_train,y_train)

GaussianNB()

In [33]:
model.score(X_test,y_test)

0.7541899441340782

In [35]:
y_test[10:20]

183    1
458    1
531    0
741    0
25     1
777    1
695    0
697    1
353    0
398    0
Name: Survived, dtype: int64

In [37]:
model.predict(X_test[10:20])

array([0, 1, 0, 1, 1, 1, 0, 1, 0, 0], dtype=int64)